// 初始化echart实例对象
var scatterChart = echarts.init(document.getElementById('scatter'), 'light',{
    width: 1000,  // 设置图表宽度
    height: 600  // 设置图表高度
});

// 指定图表的配置项和数据
// ----------左1的配置项-------------------
const schema = [
    { name: 'date', index: 0, text: '月' },
    { name: 'AQIindex', index: 1, text: 'AQI指数' },
    { name: 'PM25', index: 2, text: 'PM2.5' },
    { name: 'PM10', index: 3, text: 'PM10' },
    { name: 'CO', index: 4, text: '一氧化碳（CO）' },
    { name: 'NO2', index: 5, text: '二氧化氮（NO2）' },
    { name: 'SO2', index: 6, text: '二氧化硫（SO2）' }
  ];
  const itemStyle = {
    opacity: 0.8,
    shadowBlur: 10,
    shadowOffsetX: 0,
    shadowOffsetY: 0,
    shadowColor: 'rgba(0,0,0,0.3)'
  };
var  option3 = {
    title: {
        text: '城市月空气质量',
        textStyle: {
            color: 'black',
            fontStyle: 'normal',

        },
        left: 'center',
        bottom: 0

    },
    legend: {
      top: 10,
      data: ["北京",  "天津", "上海", "济南", "青岛", "南京", "成都", "重庆","广州" ,"西安"],
      textStyle: {
        fontSize: 16
      }
    },
    grid: {
      left: '5%',
      right: '25%',
      top: '18%',
      bottom: '10%'
    },
    tooltip: {
      backgroundColor: 'rgba(0,0,0,0.9)',
      formatter: function (param) {
        var value = param.value;
        // prettier-ignore
        return '<div style="border-bottom: 1px solid rgba(255,255,255,0.1); font-size: 18px;padding-bottom: 7px;margin-bottom: 7px">'
                  + param.seriesName + ' ' + value[0] + '月：'
                  + value[7]
                  + '</div>'
                  + schema[1].text + '：' + value[1] + '<br>'
                  + schema[2].text + '：' + value[2] + '<br>'
                  + schema[3].text + '：' + value[3] + '<br>'
                  + schema[4].text + '：' + value[4] + '<br>'
                  + schema[5].text + '：' + value[5] + '<br>'
                  + schema[6].text + '：' + value[6] + '<br>';
      }
    },
    xAxis: {
      type: 'value',
      name: '日期',
      nameGap: 16,
      nameTextStyle: {
        fontSize: 16
      },
      max: 12,
      splitLine: {
        show: false
      }
    },
    yAxis: {
      type: 'value',
      name: 'AQI指数',
      nameLocation: 'end',
      nameGap: 20,
      nameTextStyle: {
        fontSize: 16
      },
      splitLine: {
        show: false
      }
    },
    visualMap: [
      {
        left: '80%',
        top: '10%',
        dimension: 2,
        min: 0,
        max: 250,
        itemWidth: 30,
        itemHeight: 120,
        calculable: true,
        precision: 0.1,
        text: ['气泡大小：PM2.5含量'],
        textGap: 30,
        inRange: {
          symbolSize: [10, 70]
        },
        outOfRange: {
          symbolSize: [10, 70],
          color: ['rgba(255,255,255,0.4)']
        },
        controller: {
          inRange: {
            color: ['#c23531']
          },
          outOfRange: {
            color: ['#999']
          }
        }
      },
      {
        left: '80%',
        bottom: '5%',
        dimension: 6,
        min: 0,
        max: 50,
        itemHeight: 120,
        text: [' 颜色深浅：二氧化硫含量'],
        textGap: 30,
        inRange: {
          colorLightness: [0.9, 0.5]
        },
        outOfRange: {
          color: ['rgba(255,255,255,0.4)']
        },
        controller: {
          inRange: {
            color: ['#c23531']
          },
          outOfRange: {
            color: ['#999']
          }
        }
      }
    ],
    series: [
        {"name": "北京", type: 'scatter',itemStyle: itemStyle,data:[]},
        {"name": "天津", type: 'scatter',itemStyle: itemStyle,data:[]},
        {"name": "上海", type: 'scatter',itemStyle: itemStyle,data:[]},
        {"name": "济南", type: 'scatter',itemStyle: itemStyle,data:[]},
        {"name": "青岛", type: 'scatter',itemStyle: itemStyle,data:[]},
        {"name": "南京",type: 'scatter',itemStyle: itemStyle,data:[]},
        {"name": "成都", type: 'scatter',itemStyle: itemStyle,data:[]},
        {"name": "重庆", type: 'scatter',itemStyle: itemStyle,data:[]},
        {"name": "广州", type: 'scatter',itemStyle: itemStyle,data:[]},
        {"name": "西安", type: 'scatter',itemStyle: itemStyle,data:[]},
    ]
  };

  const data0 = [[
    [1, 55, 9, 56, 0.46, 18, 6, '良'],
    [2, 25, 11, 21, 0.65, 34, 9, '优'],
    [3, 154, 85, 63, 0.3, 14, 14, '中度污染'],
    [4, 33, 7, 29, 0.33, 16, 6, '优'],
    [5, 42, 24, 44, 0.76, 40, 16, '优'],
    [6, 112, 78, 90, 1.77, 68, 33, '中度污染'],
    [7, 74, 49, 77, 1.46, 48, 27, '良'],
    [8, 78, 55, 80, 1.29, 59, 29, '良'],
    [9, 222, 216, 280, 4.8, 108, 64, '重度污染'],
    [10, 185, 127, 216, 2.52, 61, 27, '中度污染'],
    [11, 39, 19, 38, 0.57, 31, 15, '优'],
    [12, 64, 51, 101, 0.862, 58, 23, '良']
  ],[
  [1, 26, 37, 27, 1.163, 27, 13, '优'],
    [2, 85, 62, 71, 1.195, 60, 8, '良'],
    [3, 78, 38, 74, 1.363, 37, 7, '良'],
    [4, 21, 21, 36, 0.634, 40, 9, '优'],
    [5, 144, 42, 46, 0.915, 81, 44, '中度污染'],
    [6, 56, 52, 69, 1.067, 92, 16, '良'],
    [7, 64, 30, 28, 0.924, 51, 2, '良'],
    [8, 55, 48, 74, 1.236, 75, 26, '良'],
    [9, 188, 85, 113, 1.237, 114, 57,'中度污染'],
    [10, 91, 81, 104, 1.041, 56, 40, '良'],
    [11, 84, 39, 60, 0.964, 25, 11, '良'],
    [12, 64, 51, 101, 0.862, 58, 23, '良'],
  ],[
    [1, 91, 45, 125, 0.82, 34, 23, '良'],
    [2, 65, 27, 78, 0.86, 45, 29, '良'],
    [3, 83, 60, 84, 1.09, 73, 27, '良'],
    [4, 109, 81, 121, 1.28, 68, 51, '轻度污染'],
    [5, 158, 77, 114, 1.07, 55, 86, '中度污染'],
    [6, 169, 81, 121, 1.28, 68, 77, '中度污染'],
    [7, 106, 77, 114, 1.07, 55, 51, '轻度污染'],
    [8, 89, 65, 78, 0.86, 51, 26, '良'],
    [9, 53, 33, 47, 0.64, 50, 17, '良'],
    [10, 80, 55, 80, 1.01, 75, 24, '良'],
    [11, 117, 81, 124, 1.03, 45, 24, '轻度污染'],
    [12, 99, 71, 142, 1.1, 62, 42, '良'],
  ],[
    [1, 41, 42, 46, 0.915, 81, 13, '优'],
    [2, 56, 52, 69, 1.067, 92, 16, '良'],
    [3, 64, 30, 28, 0.924, 51, 2, '良'],
    [4, 55, 48, 74, 1.236, 75, 26, '良'],
    [5, 76, 85, 113, 1.237, 114, 27, '良'],
    [6, 145, 81, 104, 1.041, 56, 70, '中度污染'],
    [7, 84, 39, 60, 0.964, 25, 11, '良'],
    [8, 64, 51, 101, 0.862, 58, 23, '良'],
    [9, 70, 69, 120, 1.198, 65, 36, '良'],
    [10, 77, 105, 178, 2.549, 64, 16, '良'],
    [11, 109, 68, 87, 0.996, 74, 29, '轻度污染'],
    [12, 73, 68, 97, 0.905, 51, 34, '良'],
  ],[
    [1, 54, 27, 47, 0.592, 53, 12, '良'],
    [2, 51, 61, 97, 0.811, 65, 19, '良'],
    [3, 91, 71, 121, 1.374, 43, 18, '良'],
    [4, 73, 102, 182, 2.787, 44, 19, '良'],
    [5, 73, 50, 76, 0.717, 31, 20, '良'],
    [6, 84, 94, 140, 2.238, 68, 18, '良'],
    [7, 93, 77, 104, 1.165, 53, 7, '良'],
    [8, 99, 130, 227, 3.97, 55, 15, '良'],
    [9, 146, 84, 139, 1.094, 40, 17, '轻度污染'],
    [10, 113, 108, 137, 1.481, 48, 15, '轻度污染'],
    [11, 81, 48, 62, 1.619, 26, 3, '良'],
    [12, 56, 48, 68, 1.336, 37, 9, '良'],
  ],[
    [1, 83, 60, 84, 1.09, 73, 27, '良'],
    [2, 210, 81, 121, 1.28, 68, 88, '重度污染'],
    [3, 186, 77, 114, 1.07, 55, 77, '中度污染'],
    [4, 109, 81, 121, 1.28, 68, 51, '轻度污染'],
    [5, 106, 77, 114, 1.07, 55, 51, '轻度污染'],
    [6, 89, 65, 78, 0.86, 51, 26, '良'],
    [7, 53, 33, 47, 0.64, 50, 17, '良'],
    [8, 80, 55, 80, 1.01, 75, 24, '良'],
    [9, 117, 81, 124, 1.03, 45, 24, '轻度污染'],
    [10, 99, 71, 142, 1.1, 62, 42, '良'],
    [11, 95, 69, 130, 1.28, 74, 50, '良'],
    [12, 116, 87, 131, 1.47, 84, 40, '轻度污染'],
  ],[
    [1, 116, 87, 131, 1.47, 84, 40, '轻度污染'],
    [2, 108, 80, 121, 1.3, 85, 37, '轻度污染'],
    [3, 134, 83, 167, 1.16, 57, 43, '轻度污染'],
    [4, 79, 43, 107, 1.05, 59, 37, '良'],
    [5, 71, 46, 89, 0.86, 64, 25, '良'],
    [6, 97, 71, 113, 1.17, 88, 31, '良'],
    [7, 84, 57, 91, 0.85, 55, 31, '良'],
    [8, 87, 63, 101, 0.9, 56, 41, '良'],
    [9, 104, 77, 119, 1.09, 73, 48, '轻度污染'],
    [10, 87, 62, 100, 1, 72, 28, '良'],
    [11, 168, 128, 172, 1.49, 97, 56, '中度污染'],
    [12, 65, 45, 51, 0.74, 39, 17, '良'],
  ],[
    [1, 84, 57, 91, 0.85, 55, 31, '良'],
    [2, 87, 63, 101, 0.9, 56, 41, '良'],
    [3, 104, 77, 119, 1.09, 73, 48, '轻度污染'],
    [4, 87, 62, 100, 1, 72, 28, '良'],
    [5, 168, 128, 172, 1.49, 97, 56, '中度污染'],
    [6, 65, 45, 51, 0.74, 39, 17, '良'],
    [7, 39, 24, 38, 0.61, 47, 17, '优'],
    [8, 39, 24, 39, 0.59, 50, 19, '优'],
    [9, 93, 68, 96, 1.05, 79, 29, '良'],
    [10, 188, 143, 197, 1.66, 99, 51, '中度污染'],
    [11, 174, 131, 174, 1.55, 108, 50, '中度污染'],
    [12, 187, 143, 201, 1.39, 89, 53, '中度污染']
  ],[
    [1, 95, 69, 130, 1.28, 74, 50, '良'],
    [2, 116, 87, 131, 1.47, 84, 40, '轻度污染'],
    [3, 108, 80, 121, 1.3, 85, 37, '轻度污染'],
    [4, 134, 83, 167, 1.16, 57, 43, '轻度污染'],
    [5, 79, 43, 107, 1.05, 59, 37, '良'],
    [6, 71, 46, 89, 0.86, 64, 25, '良'],
    [7, 97, 71, 113, 1.17, 88, 31, '良'],
    [8, 84, 57, 91, 0.85, 55, 31, '良'],
    [9, 87, 63, 101, 0.9, 56, 41, '良'],
    [10, 104, 77, 119, 1.09, 73, 48, '轻度污染'],
    [11, 87, 62, 100, 1, 72, 28, '良'],
    [12, 168, 128, 172, 1.49, 97, 56, '中度污染'],
  ],[
    [1, 145, 71, 121, 1.374, 43, 78, '中度污染'],
    [2, 73, 102, 182, 2.787, 44, 19, '良'],
    [3, 73, 50, 76, 0.717, 31, 20, '良'],
    [4, 84, 94, 140, 2.238, 68, 18, '良'],
    [5, 93, 77, 104, 1.165, 53, 7, '良'],
    [6, 99, 130, 227, 3.97, 55, 15, '良'],
    [7, 146, 84, 139, 1.094, 40, 17, '轻度污染'],
    [8, 113, 108, 137, 1.481, 48, 15, '轻度污染'],
    [9, 81, 48, 62, 1.619, 26, 3, '良'],
    [10, 56, 48, 68, 1.336, 37, 9, '良'],
    [11, 82, 92, 174, 3.29, 0, 13, '良'],
    [12, 106, 116, 188, 3.628, 101, 16, '轻度污染'],
  ]
];

// 使用刚指定的配置项和数据显示图表。
function updateCharts3(selectedYear) {
    // You need to replace this part with your actual data retrieval logic based on the selected year
    // For demonstration purposes, I'm assuming you have a function fetchDataForYear(year) that fetches data for the given year
    // Update  data
    for (var i = 0; i < option3.series.length; i++) {
        option3.series[i].data = data0[i];
    }
    option3.title.text = selectedYear+'年多地区 月空气质量'
    // 在 option.series 中为每个省份的 scatter 系列添加 markLine

    // Set the updated option to the chart
    scatterChart.setOption(option3);
}